In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df=pd.read_csv("data.csv")

In [4]:
df.head()

,Number,City,Colors Reported,Shape Reported,State,Time
0,123456.0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,54321.0,Willingboro,green,NaN,NJ,6/30/1930 20:00
2,87654.0,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,3456.0,Abilene,blue,DISK,KS,1/12/1900 0:00
4,7654.0,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 6 columns):
Number             12 non-null float64
City               15 non-null object
Colors Reported    6 non-null object
Shape Reported     13 non-null object
State              14 non-null object
Time               15 non-null object
dtypes: float64(1), object(5)
memory usage: 848.0+ bytes

In [7]:
df.isnull().sum()

Number             3
City               0
Colors Reported    9
Shape Reported     2
State              1
Time               0
dtype: int64

In [8]:
df["Number"].fillna(0,inplace=True)

In [10]:
df["Number"]=df["Number"].fillna(df["Number"].mean())
df["Number"]=df["Number"].fillna(df["Number"].median())

In [12]:
df["Colors Reported"]=df["Colors Reported"].replace(np.NaN,'NA')

In [13]:
df["Shape Reported"].value_counts()

DISK        3
LIGHT       2
CYLINDER    1
CIRCLE      1
TRIANGLE    1
OVAL        1
FIREBALL    1
SPHERE      1
@           1
12          1
Name: Shape Reported, dtype: int64

In [15]:
df["Shape Reported"].mode()[0]

'DISK'

In [17]:
df["Shape Reported"]=df["Shape Reported"].fillna(df["Shape Reported"].mode()[0])

In [18]:
df.isnull().sum()

Number             0
City               0
Colors Reported    0
Shape Reported     0
State              1
Time               0
dtype: int64